# ASSIGNMENT 3

In [4]:
import pandas as pd
import numpy as np
technologies= ({
    'Courses':["SPARK","PYSPARK","HADOOP","PANDAS"],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
print(df)

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

## Convert lowercase column use str.lower()

In [6]:
df['Courses'] = df['Courses'].str.lower()
print(df)

   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400

## Convert lowercase column use apply()

In [7]:
df['Courses'] = df['Courses'].apply(str.lower)
print(df)

   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400

## Use apply() & lambda function

In [9]:
df['Courses'].apply(lambda x: x.lower())
print(df)

   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400

## Convert pandas column to lowercase use map()

In [10]:
df['Courses'] = df['Courses'].map(str.lower)
print(df)

   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400

## Convert  uppercase column use str.upper()

In [12]:
df['Courses'] = df['Courses'].str.upper()
print(df)

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

## Convert uppercase column use apply()

In [13]:
df['Courses'] = df['Courses'].apply(str.upper)
print(df)

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

## Use apply() & lambda function

In [14]:
df['Courses'].apply(lambda x: x.upper())
print(df)

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

## Convert pandas column to lowercase use map()

In [15]:
df['Courses'] = df['Courses'].map(str.upper)
print(df)

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

# Find length

In [34]:

import pandas as pd

data = pd.DataFrame({

    'age' : [15, 17, 20, 14, 25],

    'name': ["Sample", "New User", "My Name", "Jane Doe", "John Doe"]

})

data['name'].str.len()

0    6
1    8
2    7
3    8
4    8
Name: name, dtype: int64

In [17]:
df['Courses'] = df['Courses'].str.len()
df

   Courses    Fee Duration Discount
0        5  22000   30days     1000
1        7  25000   50days     2300
2        6  24000   40days     2500
3        6  26000   60days     1400

# Strip Method --> Removing any leading or trailing whitespaces

In [37]:
import numpy as np
import pandas as pd
s = pd.Series(['1. Bat.  ', '2. Dog!\n', '3. fox?\t', np.nan]) 
s.str.strip()

0    1. Bat.
1    2. Dog!
2    3. fox?
3        NaN
dtype: object

In [38]:
import pandas as pd
import numpy as np
technologies= ({
    'Courses':["SPARK","PYSPARK","HADOOP","PANDAS"],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df=pd.DataFrame(technologies)

df['Courses'] = df['Courses'].str.strip()
df

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

# lstrip method  --> Removes Leading Whitespaces

In [20]:
df['Courses'] = df['Courses'].str.lstrip()
df

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

# rstrip method  --> Removes Trailing Whitespaces

In [21]:
df['Courses'] = df['Courses'].str.rstrip()
df

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400

# Split Method --> Spits each string based on specified delimeter

In [39]:
import numpy as np
import pandas as pd
s = pd.Series(["this is my new pen",
               "https://www.w3resource.com/pandas/index.php",
               np.nan])
s.str.split()

0                         [this, is, my, new, pen]
1    [https://www.w3resource.com/pandas/index.php]
2                                              NaN
dtype: object

In [22]:
df['Courses'] = df['Courses'].str.split()
df

     Courses    Fee Duration Discount
0    [SPARK]  22000   30days     1000
1  [PYSPARK]  25000   50days     2300
2   [HADOOP]  24000   40days     2500
3   [PANDAS]  26000   60days     1400

# Contains Method --> Used to check if a specified substring or pattern is present

In [23]:
df['Courses'] = df['Courses'].str.contains('PA')
df

   Courses    Fee Duration Discount
0      NaN  22000   30days     1000
1      NaN  25000   50days     2300
2      NaN  24000   40days     2500
3      NaN  26000   60days     1400

# Replace Method :- Replace specified value with another value

In [26]:
import pandas as pd
import numpy as np
technologies= ({
    'Courses':["SPARK","PYSPARK","HADOOP","PANDAS"],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df=pd.DataFrame(technologies)

df['Courses'] = df['Courses'].str.replace('HADOOP' , 'YASHLEEN')
df

    Courses    Fee Duration Discount
0     SPARK  22000   30days     1000
1   PYSPARK  25000   50days     2300
2  YASHLEEN  24000   40days     2500
3    PANDAS  26000   60days     1400

# Startswith Method :- Used to check if a string startswith a pattern or a substring

In [27]:
df['Courses'] = df['Courses'].str.startswith('S')
df

   Courses    Fee Duration Discount
0     True  22000   30days     1000
1    False  25000   50days     2300
2    False  24000   40days     2500
3    False  26000   60days     1400

# Endswith Method :- Used to check if a string endswith a pattern or a substring

In [29]:
import pandas as pd
import numpy as np
technologies= ({
    'Courses':["SPARK","PYSPARK","HADOOP","PANDAS"],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df=pd.DataFrame(technologies)

df['Courses'] = df['Courses'].str.endswith('OP')
df

   Courses    Fee Duration Discount
0    False  22000   30days     1000
1    False  25000   50days     2300
2     True  24000   40days     2500
3    False  26000   60days     1400

# Cat Method :- Used for concatenating strings. "sep" --> seperator

In [30]:
import pandas as pd
import numpy as np
technologies= ({
    'Courses':["SPARK","PYSPARK","HADOOP","PANDAS"],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df=pd.DataFrame(technologies)

df['Courses'] = df['Courses'].str.cat(df['Discount'], sep="-")
df

        Courses    Fee Duration Discount
0    SPARK-1000  22000   30days     1000
1  PYSPARK-2300  25000   50days     2300
2   HADOOP-2500  24000   40days     2500
3   PANDAS-1400  26000   60days     1400

# Get Method :- used to get the element at a specified position in each string of a string column.

In [31]:
import pandas as pd
import numpy as np
technologies= ({
    'Courses':["SPARK","PYSPARK","HADOOP","PANDAS"],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df=pd.DataFrame(technologies)

df['Courses'] = df['Courses'].str.get(0)
df

  Courses    Fee Duration Discount
0       S  22000   30days     1000
1       P  25000   50days     2300
2       H  24000   40days     2500
3       P  26000   60days     1400

# Slice Method :- Extract a substring from each element     start = 0, end = 5

In [32]:
import pandas as pd
import numpy as np
technologies= ({
    'Courses':["SPARK","PYSPARK","HADOOP","PANDAS"],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df=pd.DataFrame(technologies)

df['Courses'] = df['Courses'].str.slice(stop=3)
df

  Courses    Fee Duration Discount
0     SPA  22000   30days     1000
1     PYS  25000   50days     2300
2     HAD  24000   40days     2500
3     PAN  26000   60days     1400

# Find Method :- Used to find element     Returns index where found, if not found, retunrs -1

In [33]:
import pandas as pd
import numpy as np
technologies= ({
    'Courses':["SPARK","PYSPARK","HADOOP","PANDAS"],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df=pd.DataFrame(technologies)

df['Courses'] = df['Courses'].str.find('PARK')
df

   Courses    Fee Duration Discount
0        1  22000   30days     1000
1        3  25000   50days     2300
2       -1  24000   40days     2500
3       -1  26000   60days     1400